# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLO11 object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolo11
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 319 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 319 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 409 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  l: [1.00, 1.00, 512] # summary: 631 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  x: [1.00, 1.50, 512] # summary: 631 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  # n divides all Conv filters by 4, except the ones custom defined by me
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
   #start D2S-RFB
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4

   #top branch   
  - [-1, 1, Conv, [128, 1, 1, None, 1, 1, nn.Mish(0.1)]]
  - [-1, 1, Conv, [128, 1, 1, None, 1, 1, nn.Mish(0.1)]]    

   #middle branch 1
  - [-3, 1, Conv, [128, 1, 1, None, 1, 1, nn.Mish(0.1)]]
  - [-1, 1, DepthwiseSeparableConvBN, [64, 1, 64, nn.Mish(0.1)]]
  - [-1, 1, Conv, [128, 1, 1, None, 1, 1, nn.Mish(0.1)]]    

   #middle branch 2
  - [-6, 1, Conv, [128, 1, 1, None, 1, 1, nn.Mish(0.1)]]
  - [-1, 1, DepthwiseSeparableDilatedConvBN, [64, 1, 64, 3, 3, 3, nn.Mish(0.1)]]
  - [-1, 1, Conv, [128, 1, 1, None, 1, 1, nn.Mish(0.1)]]

   #middle branch 3
  - [-9, 1, Conv, [128, 1, 1, None, 1, 1, nn.Mish(0.1)]]
  - [-1, 1, DepthwiseSeparableDilatedConvBN, [64, 1, 64, 3, 5, 5, nn.Mish(0.1)]]    
  - [-1, 1, Conv, [128, 1, 1, None, 1, 1, nn.Mish(0.1)]]    

  - [[-1, -4, -7, -10, -12], 1, Shortcut, [1]]
  - [-1, 1, DepthwiseSeparableConvBN, [64, 1, 64, nn.Mish(0.1)]]  

   #top branch 2  
  - [-1, 1, Conv, [128, 1, 1, None, 1, 1, nn.Mish(0.1)]]
  - [-1, 1, DepthwiseSeparableDilatedConvBN, [64, 1, 64, 5, 6, 3, nn.Mish(0.1)]]    
  - [-1, 1, Conv, [128, 1, 1, None, 1, 1, nn.Mish(0.1)]]    

   #middle branch 2
  - [-4, 1, Conv, [128, 1, 1, None, 1, 1, nn.Mish(0.1)]]
  - [-1, 1, DepthwiseSeparableDilatedConvBN, [64, 1, 64, 5, 2, 1, nn.Mish(0.1)]]     
  - [-1, 1, Conv, [128, 1, 1, None, 1, 1, nn.Mish(0.1)]]    

  - [[-1, -4, -7], 1, Shortcut, [1]]
  - [-1, 1, DepthwiseSeparableConvBN, [64, 1, 64, nn.Mish(0.1)]]  
   #end D2S-RFB

  - [-1, 2, C3k2, [256, False, 0.25]]#23, old2
  - [-1, 1, Conv, [256, 3, 2]] # 24, old 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] #25, old 4
  - [-1, 1, Conv, [512, 3, 2]] # 26, old 5-P4/16
  - [-1, 2, C3k2, [512, True]] # 27, old 6
  - [-1, 1, Conv, [1024, 3, 2]] # 28, old 7-P5/32
  - [-1, 2, C3k2, [1024, True]] # 29, old 8
  - [-1, 1, SPPF, [1024, 5]] # 30, old 9
  - [-1, 2, C2PSA, [1024]] # 31, old 10

# YOLO11n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 27], 1, Concat, [1]] # cat backbone P4
   #HP-CSE 1
  - [-1, 1, HP-CSE, [768, 16]]
  - [-1, 2, C3k2, [512, False]] # 35, old13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 25], 1, Concat, [1]] # cat backbone P3
   #HP-CSE 2
  - [-1, 1, HP-CSE, [512, 16]] 
  - [-1, 2, C3k2, [256, False]] # 39, old 16 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 35], 1, Concat, [1]] # cat head P4
   #HP-CSE 3
  - [-1, 1, HP-CSE, [384, 16]]   
  - [-1, 2, C3k2, [512, False]] # 43, old19 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 31], 1, Concat, [1]] # cat head P5
   #HP-CSE 4
  - [-1, 1, HP-CSE, [768, 16]]
  - [-1, 2, C3k2, [1024, True]] # 47, old 22 (P5/32-large)

  - [[39, 43, 47], 1, Detect, [nc]] # Detect(P3, P4, P5)
