# YOLOv12 🚀, AGPL-3.0 license
# YOLOv12 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect
# CFG file for YOLOv12-turbo

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov12n.yaml' will call yolov12.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 497 layers, 2,553,904 parameters, 2,553,888 gradients, 6.2 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 497 layers, 9,127,424 parameters, 9,127,408 gradients, 19.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 533 layers, 19,670,784 parameters, 19,670,768 gradients, 60.4 GFLOPs
  l: [1.00, 1.00, 512] # summary: 895 layers, 26,506,496 parameters, 26,506,480 gradients, 83.3 GFLOPs
  x: [1.00, 1.50, 512] # summary: 895 layers, 59,414,176 parameters, 59,414,160 gradients, 185.9 GFLOPs


# YOLO12-turbo backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv,  [64, 3, 2]] # 0-P1/2
   #csp-rfbs v91
  - [-1, 1, Conv,  [128, 3, 2, 1, 2]] # 1-P2/4

   #top branch   
  - [-1, 1, Conv, [128, 1, 1, None, 1, 1, nn.Mish(0.1)]]
  - [-1, 1, Conv, [128, 1, 1, None, 1, 1, nn.Mish(0.1)]]    

   #middle branch 1
  - [-3, 1, Conv, [128, 1, 1, None, 1, 1, nn.Mish(0.1)]]
  - [-1, 1, DepthwiseSeparableConvBN, [32, 1, 32, nn.Mish(0.1)]]
  - [-1, 1, Conv, [128, 1, 1, None, 1, 1, nn.Mish(0.1)]]    

   #middle branch 2
  - [-6, 1, Conv, [128, 1, 1, None, 1, 1, nn.Mish(0.1)]]
  - [-1, 1, DepthwiseSeparableDilatedConvBN, [32, 1, 32, 3, 3, 3, nn.Mish(0.1)]]
  - [-1, 1, Conv, [128, 1, 1, None, 1, 1, nn.Mish(0.1)]]

   #middle branch 3
  - [-9, 1, Conv, [128, 1, 1, None, 1, 1, nn.Mish(0.1)]]
  - [-1, 1, DepthwiseSeparableDilatedConvBN, [32, 1, 32, 3, 5, 5, nn.Mish(0.1)]]    
  - [-1, 1, Conv, [128, 1, 1, None, 1, 1, nn.Mish(0.1)]]    

  - [[-1, -4, -7, -10, -12], 1, Shortcut, [1]]
  - [-1, 1, DepthwiseSeparableConvBN, [32, 1, 32, nn.Mish(0.1)]]  

   #top branch 2  
  - [-1, 1, Conv, [128, 1, 1, None, 1, 1, nn.Mish(0.1)]]
  - [-1, 1, DepthwiseSeparableDilatedConvBN, [32, 1, 32, 5, 6, 3, nn.Mish(0.1)]]    
  - [-1, 1, Conv, [128, 1, 1, None, 1, 1, nn.Mish(0.1)]]    

   #middle branch 2
  - [-4, 1, Conv, [128, 1, 1, None, 1, 1, nn.Mish(0.1)]]
  - [-1, 1, DepthwiseSeparableDilatedConvBN, [32, 1, 32, 5, 2, 1, nn.Mish(0.1)]]     
  - [-1, 1, Conv, [128, 1, 1, None, 1, 1, nn.Mish(0.1)]]    

  - [[-1, -4, -7], 1, Shortcut, [1]]
  - [-1, 1, DepthwiseSeparableConvBN, [32, 1, 32, nn.Mish(0.1)]]  
   #end csp-rfbs v91, va fi +21 la toate referintele

  - [-1, 2, C3k2,  [256, False, 0.25]]
  - [-1, 1, Conv,  [256, 3, 2, 1, 4]] # 24 old 3-P3/8
  - [-1, 2, C3k2,  [512, False, 0.25]]
  - [-1, 1, Conv,  [512, 3, 2]] # 26 old 5-P4/16
  - [-1, 4, A2C2f, [512, True, 4]]
  - [-1, 1, Conv,  [1024, 3, 2]] # 28 old 7-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 29 old 8

# YOLO12-turbo head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  #- [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [[-1, 27], 1, Concat, [1]] # cat backbone P4
   #Bifpn 1
  - [-1, 1, CSE_CAMv1, [384, 16]]
  - [-1, 2, A2C2f, [512, False, -1]] # 33 old 11

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
#  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [[-1, 25], 1, Concat, [1]] # cat backbone P3
   #Bifpn 2
  - [-1, 1, CSE_CAMv1, [256, 16]]
  - [-1, 2, A2C2f, [256, False, -1]] # 37 old 14

  - [-1, 1, Conv, [256, 3, 2]]
#  - [[-1, 11], 1, Concat, [1]] # cat head P4
  - [[-1, 33], 1, Concat, [1]] # cat head P4
   #Bifpn 3
  - [-1, 1, CSE_CAMv1, [192, 16]]   
  - [-1, 2, A2C2f, [512, False, -1]] # 41 old 17

  - [-1, 1, Conv, [512, 3, 2]]
#  - [[-1, 8], 1, Concat, [1]] # cat head P5
  - [[-1, 29], 1, Concat, [1]] # cat head P5
   #Bifpn 4
  - [-1, 1, CSE_CAMv1, [384, 16]]
  - [-1, 2, C3k2, [1024, True]] # 45 old 20 (P5/32-large)

#  - [[14, 17, 20], 1, Detect, [nc]] # Detect(P3, P4, P5)
  - [[37, 41, 45], 1, Detect, [nc]] # Detect(P3, P4, P5)
