# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLOv8 object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolov8
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024] # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.33, 0.50, 1024] # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  m: [0.67, 0.75, 768] # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  l: [1.00, 1.00, 512] # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  x: [1.00, 1.25, 512] # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
   #csp-rfbs v91
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4

   #top branch   
  - [-1, 1, Conv, [128, 1, 1, None, 1, 1, nn.Mish(0.1)]]
  - [-1, 1, Conv, [128, 1, 1, None, 1, 1, nn.Mish(0.1)]]    

   #middle branch 1
  - [-3, 1, Conv, [128, 1, 1, None, 1, 1, nn.Mish(0.1)]]
  - [-1, 1, DepthwiseSeparableConvBN, [32, 1, 32, nn.Mish(0.1)]]
  - [-1, 1, Conv, [128, 1, 1, None, 1, 1, nn.Mish(0.1)]]    

   #middle branch 2
  - [-6, 1, Conv, [128, 1, 1, None, 1, 1, nn.Mish(0.1)]]
  - [-1, 1, DepthwiseSeparableDilatedConvBN, [32, 1, 32, 3, 3, 3, nn.Mish(0.1)]]
  - [-1, 1, Conv, [128, 1, 1, None, 1, 1, nn.Mish(0.1)]]

   #middle branch 3
  - [-9, 1, Conv, [128, 1, 1, None, 1, 1, nn.Mish(0.1)]]
  - [-1, 1, DepthwiseSeparableDilatedConvBN, [32, 1, 32, 3, 5, 5, nn.Mish(0.1)]]    
  - [-1, 1, Conv, [128, 1, 1, None, 1, 1, nn.Mish(0.1)]]    

  - [[-1, -4, -7, -10, -12], 1, Shortcut, [1]]
  - [-1, 1, DepthwiseSeparableConvBN, [32, 1, 32, nn.Mish(0.1)]]  

   #top branch 2  
  - [-1, 1, Conv, [128, 1, 1, None, 1, 1, nn.Mish(0.1)]]
  - [-1, 1, DepthwiseSeparableDilatedConvBN, [32, 1, 32, 5, 6, 3, nn.Mish(0.1)]]    
  - [-1, 1, Conv, [128, 1, 1, None, 1, 1, nn.Mish(0.1)]]    

   #middle branch 2
  - [-4, 1, Conv, [128, 1, 1, None, 1, 1, nn.Mish(0.1)]]
  - [-1, 1, DepthwiseSeparableDilatedConvBN, [32, 1, 32, 5, 2, 1, nn.Mish(0.1)]]     
  - [-1, 1, Conv, [128, 1, 1, None, 1, 1, nn.Mish(0.1)]]    

  - [[-1, -4, -7], 1, Shortcut, [1]]
  - [-1, 1, DepthwiseSeparableConvBN, [32, 1, 32, nn.Mish(0.1)]]  
   #end csp-rfbs v91, va fi +21 la toate referintele

  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 24 old 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]] # 26 old 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 28 old 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 30 old 9

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
#  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [[-1, 27], 1, Concat, [1]] # cat backbone P4
   #Bifpn 1
  - [-1, 1, CSE_CAMv1, [384, 16]]
  - [-1, 3, C2f, [512]] # 34 old 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
#  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [[-1, 25], 1, Concat, [1]] # cat backbone P3
   #Bifpn 2
  - [-1, 1, CSE_CAMv1, [192, 16]] 
  - [-1, 3, C2f, [256]] # 38 old 15 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 34], 1, Concat, [1]] # cat head P4
   #Bifpn 3
  - [-1, 1, CSE_CAMv1, [192, 16]]   
  - [-1, 3, C2f, [512]] # 42 old 18 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 30], 1, Concat, [1]] # cat head P5
   #Bifpn 4
  - [-1, 1, CSE_CAMv1, [384, 16]]
  - [-1, 3, C2f, [1024]] # 46 old 21 (P5/32-large)

#  - [[15, 18, 21], 1, Detect, [nc]] # Detect(P3, P4, P5)
  - [[38, 42, 46], 1, Detect, [nc]] # Detect(P3, P4, P5)
