# parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# yolov7-tiny backbone
backbone:
  # [from, number, module, args] c2, k=1, s=1, p=None, g=1, act=True
  [[-1, 1, Conv, [32, 3, 2, None, 1, nn.Mish(0.1)]],  # 0-P1/2  
  
   #csp-rfbs v91
   [-1, 1, Conv, [64, 3, 2, None, 1, nn.Mish(0.1)]],  # 1-P2/4    

   #top branch   
   [-1, 1, Conv, [64, 1, 1, None, 1, nn.Mish(0.1)]],
   [-1, 1, Conv, [64, 1, 1, None, 1, nn.Mish(0.1)]],    

   #middle branch 1
   [-3, 1, Conv, [64, 1, 1, None, 1, nn.Mish(0.1)]],
   [-1, 1, DepthwiseSeparableConvBN, [64, 1, 64, nn.Mish(0.1)]],    
   [-1, 1, Conv, [64, 1, 1, None, 1, nn.Mish(0.1)]],    

   #middle branch 2
   [-6, 1, Conv, [64, 1, 1, None, 1, nn.Mish(0.1)]],
   [-1, 1, DepthwiseSeparableDilatedConvBN, [64, 1, 64, 3, 3, 3, nn.Mish(0.1)]],    
   [-1, 1, Conv, [64, 1, 1, None, 1, nn.Mish(0.1)]],    

   #middle branch 3
   [-9, 1, Conv, [64, 1, 1, None, 1, nn.Mish(0.1)]],
   [-1, 1, DepthwiseSeparableDilatedConvBN, [64, 1, 64, 3, 5, 5, nn.Mish(0.1)]],    
   [-1, 1, Conv, [64, 1, 1, None, 1, nn.Mish(0.1)]],    

   [[-1, -4, -7, -10, -12], 1, Shortcut, [1]],
   [-1, 1, DepthwiseSeparableConvBN, [64, 1, 64, nn.Mish(0.1)]],  

   #top branch 2  
   [-1, 1, Conv, [64, 1, 1, None, 1, nn.Mish(0.1)]],
   [-1, 1, DepthwiseSeparableDilatedConvBN, [64, 1, 64, 5, 6, 3, nn.Mish(0.1)]],    
   [-1, 1, Conv, [64, 1, 1, None, 1, nn.Mish(0.1)]],    

   #middle branch 2
   [-4, 1, Conv, [64, 1, 1, None, 1, nn.Mish(0.1)]],
   [-1, 1, DepthwiseSeparableDilatedConvBN, [64, 1, 64, 5, 2, 1, nn.Mish(0.1)]],     
   [-1, 1, Conv, [64, 1, 1, None, 1, nn.Mish(0.1)]],    

   [[-1, -4, -7], 1, Shortcut, [1]],
   [-1, 1, DepthwiseSeparableConvBN, [64, 1, 64, nn.Mish(0.1)]],  
   #end csp-rfbs v91, va fi +21 la toate referintele

   [-1, 1, Conv, [32, 1, 1, None, 1, nn.Mish(0.1)]],
   [-2, 1, Conv, [32, 1, 1, None, 1, nn.Mish(0.1)]],
   [-1, 1, Conv, [32, 3, 1, None, 1, nn.Mish(0.1)]],
   [-1, 1, Conv, [32, 3, 1, None, 1, nn.Mish(0.1)]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [64, 1, 1, None, 1, nn.Mish(0.1)]],  # 28 old7
   
   [-1, 1, MP, []],  # 8-P3/8
   [-1, 1, Conv, [64, 1, 1, None, 1, nn.Mish(0.1)]],
   [-2, 1, Conv, [64, 1, 1, None, 1, nn.Mish(0.1)]],
   [-1, 1, Conv, [64, 3, 1, None, 1, nn.Mish(0.1)]],
   [-1, 1, Conv, [64, 3, 1, None, 1, nn.Mish(0.1)]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [128, 1, 1, None, 1, nn.Mish(0.1)]],  # 35 old14
   
   [-1, 1, MP, []],  # 15-P4/16
   [-1, 1, Conv, [128, 1, 1, None, 1, nn.Mish(0.1)]],
   [-2, 1, Conv, [128, 1, 1, None, 1, nn.Mish(0.1)]],
   [-1, 1, Conv, [128, 3, 1, None, 1, nn.Mish(0.1)]],
   [-1, 1, Conv, [128, 3, 1, None, 1, nn.Mish(0.1)]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1, None, 1, nn.Mish(0.1)]],  # 42 old21
   
   [-1, 1, MP, []],  # 22-P5/32
   [-1, 1, Conv, [256, 1, 1, None, 1, nn.Mish(0.1)]],
   [-2, 1, Conv, [256, 1, 1, None, 1, nn.Mish(0.1)]],
   [-1, 1, Conv, [256, 3, 1, None, 1, nn.Mish(0.1)]],
   [-1, 1, Conv, [256, 3, 1, None, 1, nn.Mish(0.1)]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [512, 1, 1, None, 1, nn.Mish(0.1)]],  # 49 old28
  ]

# yolov7-tiny head
head:
   #Start SPPCSP
  [[-1, 1, Conv, [256, 1, 1, None, 1, nn.Mish(0.1)]],
   [-2, 1, Conv, [256, 1, 1, None, 1, nn.Mish(0.1)]],
   [-1, 1, SP, [5]],
   [-2, 1, SP, [9]],
   [-3, 1, SP, [13]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1, None, 1, nn.Mish(0.1)]],
   [[-1, -7], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1, None, 1, nn.Mish(0.1)]],  # 58 old37
   #End SPPCSP
  
   [-1, 1, Conv, [128, 1, 1, None, 1, nn.Mish(0.1)]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [42, 1, Conv, [128, 1, 1, None, 1, nn.Mish(0.1)]], # route backbone P4
   [[-1, -2], 1, Concat, [1]],
   
   #Bifpn 1
   [-1, 1, CSE_CAMv1, [256, 16]],   
   
   [-1, 1, Conv, [64, 1, 1, None, 1, nn.Mish(0.1)]],
   [-2, 1, Conv, [64, 1, 1, None, 1, nn.Mish(0.1)]],
   [-1, 1, Conv, [64, 3, 1, None, 1, nn.Mish(0.1)]],
   [-1, 1, Conv, [64, 3, 1, None, 1, nn.Mish(0.1)]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [128, 1, 1, None, 1, nn.Mish(0.1)]],  # 69 old47
  
   [-1, 1, Conv, [64, 1, 1, None, 1, nn.Mish(0.1)]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [35, 1, Conv, [64, 1, 1, None, 1, nn.Mish(0.1)]], # route backbone P3
   [[-1, -2], 1, Concat, [1]],

   #Bifpn 2
   [-1, 1, CSE_CAMv1, [128, 16]],   
   
   [-1, 1, Conv, [32, 1, 1, None, 1, nn.Mish(0.1)]],
   [-2, 1, Conv, [32, 1, 1, None, 1, nn.Mish(0.1)]],
   [-1, 1, Conv, [32, 3, 1, None, 1, nn.Mish(0.1)]],
   [-1, 1, Conv, [32, 3, 1, None, 1, nn.Mish(0.1)]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [64, 1, 1, None, 1, nn.Mish(0.1)]],  # 80 old57
   
   [-1, 1, Conv, [128, 3, 2, None, 1, nn.Mish(0.1)]],
   [[-1, 69], 1, Concat, [1]],


   #Bifpn 3
   [-1, 1, CSE_CAMv1, [256, 16]],   
   
   [-1, 1, Conv, [64, 1, 1, None, 1, nn.Mish(0.1)]],
   [-2, 1, Conv, [64, 1, 1, None, 1, nn.Mish(0.1)]],
   [-1, 1, Conv, [64, 3, 1, None, 1, nn.Mish(0.1)]],
   [-1, 1, Conv, [64, 3, 1, None, 1, nn.Mish(0.1)]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [128, 1, 1, None, 1, nn.Mish(0.1)]],  # 89 old65
   
   [-1, 1, Conv, [256, 3, 2, None, 1, nn.Mish(0.1)]],
   [[-1, 58], 1, Concat, [1]],

   #Bifpn 4
   [-1, 1, CSE_CAMv1, [512, 16]],   
   
   [-1, 1, Conv, [128, 1, 1, None, 1, nn.Mish(0.1)]],
   [-2, 1, Conv, [128, 1, 1, None, 1, nn.Mish(0.1)]],
   [-1, 1, Conv, [128, 3, 1, None, 1, nn.Mish(0.1)]],
   [-1, 1, Conv, [128, 3, 1, None, 1, nn.Mish(0.1)]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1, None, 1, nn.Mish(0.1)]],  # 98 old73
      
   [80, 1, Conv, [128, 3, 1, None, 1, nn.Mish(0.1)]],
   [89, 1, Conv, [256, 3, 1, None, 1, nn.Mish(0.1)]],
   [98, 1, Conv, [512, 3, 1, None, 1, nn.Mish(0.1)]],

   [[99,100,101], 1, IDetect, [nc, anchors]],   # Detect(P3, P4, P5)

  ]
